tap 'caskroom/cask'
tap 'homebrew/science'

# numeric
brew 'gcc'
brew 'icu4c'

# font
brew 'freetype'
brew 'fontconfig'

# c
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'ctags'

# java
cask 'java'

# version control
brew 'git-extras'
brew 'git-cal'
brew 'git-flow'
brew 'mercurial'
brew 'meld'

# network
brew 'aircrack-ng'
brew 'arp-scan'
brew 'b43-fwcutter'
brew 'nmap'
brew 'reaver'
brew 'subnetcalc'
brew 'ettercap'

# log
brew 'logrotate'
brew 'logstash'

# monitoring
brew 'monit'
brew 'nagios'
brew 'zabbix'

# heroku
brew 'heroku-toolbelt'

# frontend
brew 'node'
brew 'npm'

# browser
brew 'chromedriver'
brew 'phantomjs'

# r
cask 'xquartz'
brew 'r'

# android
brew 'android-sdk'

# utils
brew 'asciinema'
brew 'autojump'
brew 'cputhrottle'
brew 'curl'
brew 'editorconfig'
brew 'fuzzy-find'
brew 'htop-osx'
brew 'mackup'
brew 'md5deep'
brew 'pstree'
brew 'sassc'
brew 'thefuck'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# server
brew 'nginx'
brew 'uwsgi'
brew 'tomcat'
brew 'haproxy'

# amazon
brew 's3cmd'

# python
brew 'python'
brew 'python3'
brew 'pypy'
brew 'pypy3'
brew 'pyqt'
brew 'pyqt5'
brew 'pygtk'
brew 'pygobject'
brew 'tesseract'
brew 'readline'

# computer vision
brew 'opencv'

# cache
brew 'libmemcached'
brew 'memcached'
brew 'memcache-top'
brew 'varnish3'

# search
brew 'elasticsearch'

# distributed systems
brew 'zeromq'

# languages
brew 'lua'
brew 'go'
brew 'scala'
brew 'erlang'
brew 'elixir'

# elixir
brew 'elixir-build'
brew 'exenv'

# queue
brew 'rabbitmq'

# database
brew 'mongodb'
brew 'mysql'
brew 'redis'
brew 'cassandra'
brew 'couchdb'
brew 'hadoop'
brew 'riak'

# bi
brew 'kettle'

# postgres
brew 'pgbadger'
brew 'pgbouncer'
brew 'pgcli'
brew 'pgformatter'
brew 'postgis'
brew 'postgresql'

# image
brew 'imagemagick'
brew 'graphicsmagick'

# media
brew 'faac'
brew 'ffmpeg'
brew 'flac'
brew 'jpeg'
brew 'lame'
brew 'libpng'
brew 'libtiff'
brew 'mplayer'
brew 'openjpeg'

# docs
brew 'ghostscript'
brew 'gettext'
brew 'rubber'
brew 'pdf-tools'

# other useful binaries
brew 'libxml2'
brew 'libyaml'
brew 'swig'
